app/views/miniatures/show.html.erb

	Type <%= m.war_type %><br>
	Armies <%= m.armies.empty? ? "< none >" : m.armies.map(&:name).join(", ") %><br>
---
SELECT "armies".* FROM "armies" INNER JOIN "armies_miniatures" ON "armies"."id" = "armies_miniatures"."army_id" WHERE "armies_miniatures"."miniature_id" = 1