app/controllers/armies_controller.rb

SELECT "armies".* FROM "armies"
---
  def show
    @armies = Army.all