app/controllers/miniatures_controller.rb

  def create
    @miniature = Miniature.new(params[:miniature])

    respond_to do |format|
        if @miniature.save
---
INSERT INTO "miniatures" ("created_at", "name", "updated_at", "war_type") VALUES (?, ?, ?, ?)  [["created_at", Wed, 23 May 2012 22:02:06 UTC +00:00], ["name", "test"], ["updated_at", Wed, 23 May 2012 22:02:06 UTC +00:00], ["war_type", "test"]]

  def show
    breadcrumbs.add 'Miniatures', miniatures_path
    @miniatures = Miniature.all
---
SELECT "miniatures".* FROM "miniatures"